Tekla Open API Reference for Tekla Structures 2025
LevelMark.ModelObjectIdentifier Property
 Gets the model object identifier
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Identifier ModelObjectIdentifier { get; }
Public ReadOnly Property ModelObjectIdentifier As Identifier
	Get
Property Value
Type: Identifier
See Also
Reference
LevelMark Class
Tekla.Structures.Drawing Namespace